LOPE/echemLatticeSmooth/run01/constant/dAreaInterpIn.txt
10000
(
7.524930635760e+01
7.524230269052e+01
7.522829532555e+01
7.521428789894e+01
7.520028041068e+01
7.518627286078e+01
7.517226524923e+01
7.515825757604e+01
7.514424984120e+01
7.513024204473e+01
7.511623418660e+01
7.510222626684e+01
7.508821828542e+01
7.507421024237e+01
7.506020213767e+01
7.504619397133e+01
7.503218574334e+01
7.501817745371e+01
7.500416910244e+01
7.499016068952e+01
7.497615221495e+01
7.496214367875e+01
7.494813508089e+01
7.493412642140e+01
7.492011770026e+01
7.490610891748e+01
7.489210007305e+01
7.487809116698e+01
7.486408219926e+01
7.485007316990e+01
7.483606407890e+01
7.482205492625e+01
7.480804571196e+01
7.479403643602e+01
7.478002709844e+01
7.476601769922e+01
7.475200823835e+01
7.473799871584e+01
7.472398913168e+01
7.470997948589e+01
7.469596977844e+01
7.468196000936e+01
7.466795017862e+01
7.465394028625e+01
7.463993033223e+01
7.462592031656e+01
7.461191023926e+01
7.459790010031e+01
7.458388989971e+01
7.456987963747e+01
7.455586931358e+01
7.454185892806e+01
7.452784848089e+01
7.451383797207e+01
7.449982740161e+01
7.448581676951e+01
7.447180607576e+01
7.445779532036e+01
7.444378450333e+01
7.442977362465e+01
7.441576268432e+01
7.440175168236e+01
7.438774061874e+01
7.437372949349e+01
7.435971830659e+01
7.434570705804e+01
7.433169574786e+01
7.431768437602e+01
7.430367294255e+01
7.428966144743e+01
7.427564989066e+01
7.426163827225e+01
7.424762659220e+01
7.423361485050e+01
7.421960304716e+01
7.420559118218e+01
7.419157925555e+01
7.417756726728e+01
7.416355521736e+01
7.414954310580e+01
7.413553093260e+01
7.412151869775e+01
7.410750640126e+01
7.409349404311e+01
7.407948162333e+01
7.406546914191e+01
7.405145659884e+01
7.403744399413e+01
7.402343132777e+01
7.400941859977e+01
7.399540581012e+01
7.398139295884e+01
7.396738004590e+01
7.395336707133e+01
7.393935403511e+01
7.392534093724e+01
7.391132777773e+01
7.389731455658e+01
...
)
